/**
 * 包内存放的是自定义rpc协议的实现，协议结构为:
 * +---------------------------------------------------------------+
 * | 魔数 2byte | 协议版本号 1byte | 序列化算法 1byte | 报文类型 1byte  |
 * +---------------------------------------------------------------+
 * | 状态 1byte |        消息 ID 8byte     |      数据长度 4byte     |
 * +---------------------------------------------------------------+
 * |                   数据内容 （长度不定）                          |
 * +---------------------------------------------------------------+
 *
 * MiniRpcProtocol中的泛型T在请求时是MiniRpcRequest，响应时是MiniRpcResponse
 */
package com.chenx.rpc.protocol;